
# 类：
#    属性：类属性，对象属性，私有属性
#    方法：对象方法，私有方法， 类方法，静态方法


# 类方法: (掌握)
# @classmethod
#    1.类方法可以用类名来调用（推荐），也可以用对象来调用
#    2.类方法作用是：不需要创建对象(不需要消耗对象内存)，就可以直接使用类方法，可以节省内存
#    3.类方法中有cls,没有self,表示可以去调用类名能调用的，不能调用对象属性，对象方法，私有属性，私有方法
#      cls可以调用类属性，其他类方法，静态方法

# 静态方法:（了解）
# @staticmethod
#    1.静态方法可以用类名来调用（推荐），也可以用对象来调用
#    2.静态方法作用是：不需要创建对象(不需要消耗对象内存)，就可以直接使用静态方法，可以节省内存（类名来调用）
#    3. 既没有cls，也没有self，静态方法内部不需要调用类中的任何属性和方法

# 类型  	    装饰器	        第一个参数	    谁调用
# 对象方法	无	            self（对象）	    对象
# 私有方法	无（名字 __x）	self	        类内
# 类方法	    @classmethod	cls（类）	    类名
# 静态方法	@staticmethod	无	            类名

class Animal:
    name='牧羊人'

    @classmethod
    def run(cls):#cls指的就是当前的类,所以能访问类属性、其他类方法，但不能访问对象属性/对象方法（因为压根没对象）。
        print('我是类方法')
        print(cls.name)
        print(cls==Animal)
Animal.run()

class Animal2:
    @staticmethod
    def eat():
        print('我是静态方法')
Animal2.eat()
#静态方法就像是普通函数一样，只不过放在类里解决一些问题！！！！！！
# 静态方法 = 普通函数，因为「和这个类逻辑相关」所以放进类里统一管理
# 它不解决类/对象的数据问题，只是借了类的「外壳」做收纳。

# 没有 cls、没有 self —— 它是「独立函数」，只是借类的壳存放。
# 内部不碰类的任何属性/方法，纯粹一个功能函数。
# 定位：跟类逻辑相关、但不需要访问类数据的函数，就做成静态方法。












