''''''
# 封装思路:
#    项目 => 文件夹(包) => 文件(模块) => 类 => 函数 => 代码

'''
问题: 代码重复
     后期维护成本太高
	 代码可读性不高

解决问题：函数
	在一个完整的项目中，某些功能会被反复使用，那么将这部分功能对应的代码提取出来，
	当需要使用功能的时候直接使用
	
本质：对一些特殊功能的封装

优点：
	a.简化代码结构，提高应用的效率
	b.提高代码复用性
	c.提高代码的可读性和可维护性

建议：但凡涉及到功能，都尽量使用函数实现
'''


# 函数定义 : def
def sum(a,b):
    print(f'a:{a},b:{b}')
sum(5,6)

# 函数必须调用才会执行


# 一.函数的参数(必须要掌握)
#  形参: 形式参数
#  实参: 实际参数
print('---------------------------------------------------------------------')
def fn1(a,b,c=7):
    print(f'a:{a},b:{b},c:{c}')
fn1(5,6)

def fn2(a,b,c=7,d=8):
    print(f'a:{a},b:{b},c:{c},d:{d}')
fn2(5,6,d=88)

# 细分参数种类:
#  1. 必需的位置参数,
#  2. 默认参数,
#  3. 关键字参数, 一般和默认参数结合,




# 4. 不定长参数
#  *args: 接收任意多个位置参数, 元组
#  **kwargs: 接收任意多个关键字参数, 字典
print('---------------------------------------------------------------------')
def func(*args):#加星号表示可以传入多个参数，这些参数会被打包成一个元组，名字叫args
    for arg,i in zip(args,range(len(args))):#zip将里面的参数逐个配对，得到：[(12,0), (34,1), ('abcd',2), (True,3)]
        print("arg%d=%s"%(i,arg))#%(i,arg),将参数填入模板中
print("====func")
func(12,34,'abcd',True)
def func2(**kwargs):#两个星号 ** 表示可以接收任意多个带名称的参数（关键字参数）,这些参数会被返回成一个字典，名字叫kwargs
    for key,val in kwargs.items():#把字典转换成键值对列表
        print("%s=%s"%(key,val))
print("====func2")
func2(myname="Tom",sep="comma",age=23)


# 二.返回值: return
#  1. return要写在函数内部, 返回 值
#  2. 如果不写return则默认会返回None
#  3. return会立刻结束函数,并返回值
print('---------------------------------------------------------------------')
def add(a,b):#形式参数
    return a+b #只写return，表示立即结束函数，返回None
add(1,2)#实际参数
print(add(3,4))


# 函数参数顺序
#   形参顺序: 位置参数，*args,  默认参数，**kwargs
#   实参顺序: 位置参数，        关键字参数
print('---------------------------------------------------------------------')
def fn(a,b,*args,d=7,e=8,**kwargs):
    print(a,b,args)
    print(d,e,kwargs)
fn(2,3,4,5,d=77,e=88,f=99,g=100)


# 通用参数
print('---------------------------------------------------------------------')
def fun(*args,**kwargs):
    print(args,kwargs)
fun(2,3,4,5,d=77,e=88,f=99,g=100)


